{
    "_defaultOther": ["zh_G"],
    "origin": {
        "rARWxAs": "Path",
        "Td7tsqJ": "Synopsis",
        "DyZ2M4d": "Package bpf implements marshaling and unmarshaling of programs for the Berkeley Packet Filter virtual machine, and provides a Go implementation of the virtual machine.",
        "XcWSs8E": "Package context defines the Context type, which carries deadlines, cancelation signals, and other request-scoped values across API boundaries and between processes.",
        "3ZJfG8b": "Package ctxhttp provides helper functions for performing context-aware HTTP requests.",
        "Ga85YF7": "Package dict implements the Dictionary Server Protocol as defined in RFC 2229.",
        "KqKhASP": "Package dnsmessage provides a mostly RFC 1035 compliant implementation of DNS message packing and unpacking.",
        "UuGanMC": "Package html implements an HTML5-compliant tokenizer and parser.",
        "eVvss28": "Package atom provides integer codes (also known as atoms) for a fixed set of frequently occurring HTML strings: tag names and attribute keys such as \"p \"and \"id \".",
        "c6nT2wm": "Package charset provides common text encodings for HTML documents.",
        "wXKLeMD": "Package http2 implements the HTTP/2 protocol.",
        "V3yXrNC": "Package h2c implements the unencrypted \"h2c \"form of HTTP/2.",
        "6Y57FEZ": "The h2i command is an interactive HTTP/2 console.",
        "ZqDUmGg": "Package hpack implements HPACK, a compression format for efficiently representing HTTP header fields in the context of HTTP/2.",
        "8RuBjZT": "Package httpguts provides functions implementing various details of the HTTP specification.",
        "YKcPqFz": "Package httpproxy provides support for HTTP proxy determination based on environment variables, as provided by net/http 's ProxyFromEnvironment function.",
        "keQ8eny": "Package icmp provides basic functions for the manipulation of messages used in the Internet Control Message Protocols, ICMPv4 and ICMPv6.",
        "B4Mfum2": "Package idna implements IDNA2008 using the compatibility processing defined by UTS (Unicode Technical Standard) #46, which defines a standard to deal with the transition from IDNA2003.",
        "KhvtgrX": "Package iana provides protocol number resources managed by the Internet Assigned Numbers Authority (IANA).",
        "HAkvEfN": "Package socket provides a portable interface for socket system calls.",
        "Spf38jX": "Package socks provides a SOCKS version 5 client implementation.",
        "nPrLTgs": "Package sockstest provides utilities for SOCKS testing.",
        "Ph4x2Bd": "Package timeseries implements a time series structure for stats collection.",
        "ND75xrc": "Package ipv4 implements IP-level socket options for the Internet Protocol version 4.",
        "y2cbHtu": "Package ipv6 implements IP-level socket options for the Internet Protocol version 6.",
        "FygTREV": "Package nettest provides utilities for network testing.",
        "uYEuqJY": "Package netutil provides network utility functions, complementing the more common ones in the net package.",
        "bpXuNh4": "Package proxy provides support for a variety of protocols to proxy network data.",
        "hX7JyNL": "Package publicsuffix provides a public suffix list based on data from https://publicsuffix.org/",
        "CM3ph7r": "Package route provides basic functions for the manipulation of packet routing facilities on BSD variants.",
        "AhGdebP": "Package trace implements tracing of requests and long-lived objects.",
        "fZxQNvg": "Package webdav provides a WebDAV server implementation.",
        "7sF5Pv4": "Package xml implements a simple XML 1.0 parser that understands XML name spaces.",
        "jzEN4cK": "Package websocket implements a client and server for the WebSocket protocol as specified in RFC 6455.",
        "q5sVEA9": "Package xsrftoken provides methods for generating and validating secure XSRF tokens."
    },
    "zh_G": {
        "rARWxAs": "路徑",
        "Td7tsqJ": "概要",
        "DyZ2M4d": "包bpf實現了Berkeley Packet Filter虛擬機程序的編組和解組，並提供了虛擬機的Go實現。",
        "XcWSs8E": "包上下文定義了Context類型，它跨API邊界和進程之間攜帶截止日期，取消信號和其他請求範圍的值。",
        "3ZJfG8b": "包ctxhttp提供了幫助函數，用於執行上下文感知的HTTP請求。",
        "Ga85YF7": "包dict實現RFC 2229中定義的字典服務器協議。",
        "KqKhASP": "Package dnsmessage主要提供符合RFC 1035的DNS消息打包和解包實現。",
        "UuGanMC": "包html實現了一個符合HTML5的標記器和解析器。",
        "eVvss28": "Package atom為一組固定的頻繁出現的HTML字符串提供整數代碼（也稱為atoms）：標記名稱和屬性鍵，如“p”和“id”。",
        "c6nT2wm": "Package charset為HTML文檔提供常見的文本編碼。",
        "wXKLeMD": "包http2實現HTTP / 2協議。",
        "V3yXrNC": "包h2c實現HTTP / 2的未加密“h2c”形式。",
        "6Y57FEZ": "h2i命令是交互式HTTP / 2控制台。",
        "ZqDUmGg": "Package hpack實現了HPACK，這是一種壓縮格式，用於在HTTP / 2的上下文中有效地表示HTTP頭字段。",
        "8RuBjZT": "包httpgguts提供了實現HTTP規範的各種細節的函數。",
        "YKcPqFz": "包httpproxy支持基於環境變量的HTTP代理確定，由net / http的ProxyFromEnvironment函數提供。",
        "keQ8eny": "包icmp提供了操作Internet控制消息協議，ICMPv4和ICMPv6中使用的消息的基本功能。",
        "B4Mfum2": "Package idna使用由UTS（Unicode技術標準）＃46定義的兼容性處理實現IDNA2008，該處理定義了一個處理IDNA2003過渡的標準。",
        "KhvtgrX": "Package iana提供由Internet Assigned Numbers Authority（IANA）管理的協議號資源。",
        "HAkvEfN": "包插槽為套接字系統調用提供了可移植的接口。",
        "Spf38jX": "Package socks提供SOCKS版本5客戶端實現。",
        "nPrLTgs": "包sockstest為SOCKS測試提供實用程序。",
        "Ph4x2Bd": "包時間序列實現了統計信息收集的時間序列結構。",
        "ND75xrc": "包ipv4實現了Internet協議版本4的IP級套接字選項。",
        "y2cbHtu": "包ipv6實現了Internet協議版本6的IP級套接字選項。",
        "FygTREV": "包nettest提供網絡測試實用程序。",
        "uYEuqJY": "包netutil提供網絡實用程序功能，補充網絡包中更常見的功能。",
        "bpXuNh4": "包代理提供對各種協議的支持，以代理網絡數據。",
        "hX7JyNL": "包publicsuffix提供了一個基於來自https://publicsuffix.org/的數據的公共後綴列表",
        "CM3ph7r": "包路由提供了在BSD變體上操作分組路由設施的基本功能。",
        "AhGdebP": "包跟踪實現了對請求和長期對象的跟踪。",
        "fZxQNvg": "包webdav提供WebDAV服務器實現。",
        "7sF5Pv4": "Package xml實現了一個簡單的XML 1.0解析器，它可以理解XML名稱空間。",
        "jzEN4cK": "包websocket實現了RFC6455中指定的WebSocket協議的客戶端和服務器。",
        "q5sVEA9": "包xsrftoken提供了生成和驗證安全XSRF令牌的方法。"
    }
}

